#қарапайым XOR шифры аддитивті шифрдың бір түрі болып табылады
#(XOR) – көптеген шифрлау алгоритмдерінде қолданылатын іргелі математикалық операция.
#XOR келесі нәтижелермен бір уақытта бір битпен жұмыс істейді:

#0 XOR 0 = 0
#0 XOR 1 = 1
#1 XOR 0 = 1
#1 XOR 1 = 0
text = input("Введите слово: ")
key = 4
ciphertext = ""
for char in text:     #ASCII
#Python тіліндегі ord() функциясы бір Юникод таңбалы жол аргументін алады және оның бүтін код нүктесінің мәнін қайтарады.
   enc_num = ord(char) ^ key# ^ побитовое "исключительно или"

#Python тіліндегі chr() функциясы бүтін сан аргументін алып, сол код нүктесіндегі таңбаны көрсететін жолды қайтарады
 
   enc_char = chr(enc_num)
   print(char, "->", enc_char)
   ciphertext += enc_char
print(" text:",text,"\n","key:",key,"\n","16:",ciphertext.encode().hex(),"\n","Результат:",ciphertext,)
